Ran Plan for project: `wrestleutopia-prod` dir: `accounts/wrestleutopia-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_apigatewayv2_api.http will be created
+ resource "aws_apigatewayv2_api" "http" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + ip_address_type              = (known after apply)
      + name                         = "wrestleutopia-api"
      + protocol_type                = "HTTP"
      + region                       = "us-east-2"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }

      + cors_configuration {
          + allow_headers  = [
              + "authorization",
              + "content-type",
            ]
          + allow_methods  = [
              + "DELETE",
              + "GET",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + allow_origins  = [
              + "https://wrestleutopia.com",
              + "https://www.wrestleutopia.com",
            ]
          + expose_headers = [
              + "content-type",
            ]
          + max_age        = 3600
        }
    }

  # aws_apigatewayv2_authorizer.jwt will be created
+ resource "aws_apigatewayv2_authorizer" "jwt" {
      + api_id                           = (known after apply)
      + authorizer_result_ttl_in_seconds = (known after apply)
      + authorizer_type                  = "JWT"
      + id                               = (known after apply)
      + identity_sources                 = [
          + "$request.header.Authorization",
        ]
      + name                             = "cognito-jwt"
      + region                           = "us-east-2"

      + jwt_configuration {
          + audience = [
              + "6f4qoincbfm9g0lifod7q8nuhg",
            ]
          + issuer   = "https://cognito-idp.us-east-2.amazonaws.com/us-east-2_9oCzdeOZF"
        }
    }

  # aws_apigatewayv2_integration.api_lambda will be created
+ resource "aws_apigatewayv2_integration" "api_lambda" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + region                                    = "us-east-2"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_integration.presign_lambda will be created
+ resource "aws_apigatewayv2_integration" "presign_lambda" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + region                                    = "us-east-2"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.default will be created
+ resource "aws_apigatewayv2_route" "default" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = (known after apply)
      + id                 = (known after apply)
      + region             = "us-east-2"
      + route_key          = "$default"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.presign will be created
+ resource "aws_apigatewayv2_route" "presign" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = (known after apply)
      + id                 = (known after apply)
      + region             = "us-east-2"
      + route_key          = "GET /s3/presign"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_stage.prod will be created
+ resource "aws_apigatewayv2_stage" "prod" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + region        = "us-east-2"
      + tags_all      = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
    }

  # aws_dynamodb_table.applications will be created
+ resource "aws_dynamodb_table" "applications" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "tryoutId"
      + id               = (known after apply)
      + name             = "wrestleutopia-Applications"
      + range_key        = "applicantId"
      + read_capacity    = (known after apply)
      + region           = "us-east-2"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "applicantId"
          + type = "S"
        }
      + attribute {
          + name = "applicantIdGsi"
          + type = "S"
        }
      + attribute {
          + name = "tryoutId"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "applicantIdGsi"
          + name               = "ByApplicant"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # aws_dynamodb_table.promoters will be created
+ resource "aws_dynamodb_table" "promoters" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "userId"
      + id               = (known after apply)
      + name             = "wrestleutopia-PromoterProfiles"
      + read_capacity    = (known after apply)
      + region           = "us-east-2"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "userId"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # aws_dynamodb_table.tryouts will be created
+ resource "aws_dynamodb_table" "tryouts" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "tryoutId"
      + id               = (known after apply)
      + name             = "wrestleutopia-Tryouts"
      + read_capacity    = (known after apply)
      + region           = "us-east-2"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "date"
          + type = "S"
        }
      + attribute {
          + name = "ownerId"
          + type = "S"
        }
      + attribute {
          + name = "status"
          + type = "S"
        }
      + attribute {
          + name = "tryoutId"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "ownerId"
          + name               = "ByOwner"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + global_secondary_index {
          + hash_key           = "status"
          + name               = "OpenByDate"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "date"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # aws_dynamodb_table.wrestlers will be created
+ resource "aws_dynamodb_table" "wrestlers" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "userId"
      + id               = (known after apply)
      + name             = "wrestleutopia-WrestlerProfiles"
      + read_capacity    = (known after apply)
      + region           = "us-east-2"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "userId"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # aws_iam_policy.api_dynamo_policy will be created
+ resource "aws_iam_policy" "api_dynamo_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "CRUD on WrestlerProfiles, PromoterProfiles, Tryouts (+GSIs), Applications (+GSIs)"
      + id               = (known after apply)
      + name             = "wrestleutopia-api-dynamo"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
    }

  # aws_iam_policy.api_s3_media_policy will be created
+ resource "aws_iam_policy" "api_s3_media_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow API Lambda limited S3 access under user/* prefix"
      + id               = (known after apply)
      + name             = "wrestleutopia-api-s3-media"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::prod-wrestleutopia-media-bucket/user/*"
                      + Sid      = "UserPrefixRW"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
    }

  # aws_iam_policy.presign_s3_policy will be created
+ resource "aws_iam_policy" "presign_s3_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow presign Lambda to sign S3 PUTs under user/* prefix"
      + id               = (known after apply)
      + name             = "wrestleutopia-presign-s3"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::prod-wrestleutopia-media-bucket/user/*"
                      + Sid      = "AllowPutOnUserPrefix"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
    }

  # aws_iam_role.api_lambda_role will be created
+ resource "aws_iam_role" "api_lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "wrestleutopia-api-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.presign_lambda_role will be created
+ resource "aws_iam_role" "presign_lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "wrestleutopia-presign-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.api_dynamo_attach will be created
+ resource "aws_iam_role_policy_attachment" "api_dynamo_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "wrestleutopia-api-role"
    }

  # aws_iam_role_policy_attachment.api_logs_attach will be created
+ resource "aws_iam_role_policy_attachment" "api_logs_attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::390402544450:policy/wrestleutopia-lambda-logs"
      + role       = "wrestleutopia-api-role"
    }

  # aws_iam_role_policy_attachment.api_s3_media_attach will be created
+ resource "aws_iam_role_policy_attachment" "api_s3_media_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "wrestleutopia-api-role"
    }

  # aws_iam_role_policy_attachment.presign_logs_attach will be created
+ resource "aws_iam_role_policy_attachment" "presign_logs_attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::390402544450:policy/wrestleutopia-lambda-logs"
      + role       = "wrestleutopia-presign-role"
    }

  # aws_iam_role_policy_attachment.presign_s3_attach will be created
+ resource "aws_iam_role_policy_attachment" "presign_s3_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "wrestleutopia-presign-role"
    }

  # aws_lambda_function.api will be created
+ resource "aws_lambda_function" "api" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/api/api.zip"
      + function_name                  = "wrestleutopia-api"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "us-east-2"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "Fsob643hKNMilRhA1Z8N9BE83wRNIU8q761H0iDZbos="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + timeout                        = 15
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "MEDIA_BUCKET"    = "prod-wrestleutopia-media-bucket"
              + "TABLE_APPS"      = "wrestleutopia-Applications"
              + "TABLE_PROMOTERS" = "wrestleutopia-PromoterProfiles"
              + "TABLE_TRYOUTS"   = "wrestleutopia-Tryouts"
              + "TABLE_WRESTLERS" = "wrestleutopia-WrestlerProfiles"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_function.presign will be created
+ resource "aws_lambda_function" "presign" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/presign/presign.zip"
      + function_name                  = "wrestleutopia-presign"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "us-east-2"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "VoUEgv+2WenO8h7gRz727ho6i7oeM72rvQ3UEOevDuE="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "MEDIA_BUCKET" = "prod-wrestleutopia-media-bucket"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_permission.api_invoke will be created
+ resource "aws_lambda_permission" "api_invoke" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "wrestleutopia-api"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "us-east-2"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGwInvokeApi"
      + statement_id_prefix = (known after apply)
    }

  # aws_lambda_permission.presign_invoke will be created
+ resource "aws_lambda_permission" "presign_invoke" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "wrestleutopia-presign"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "us-east-2"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGwInvokePresign"
      + statement_id_prefix = (known after apply)
    }

  # aws_s3_bucket_cors_configuration.media will be created
+ resource "aws_s3_bucket_cors_configuration" "media" {
      + bucket = "prod-wrestleutopia-media-bucket"
      + id     = (known after apply)
      + region = "us-east-2"

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "GET",
              + "PUT",
            ]
          + allowed_origins = [
              + "https://wrestleutopia.com",
              + "https://www.wrestleutopia.com",
            ]
          + expose_headers  = [
              + "ETag",
            ]
            id              = null
          + max_age_seconds = 3600
        }
    }

  # aws_s3_bucket_public_access_block.media will be created
+ resource "aws_s3_bucket_public_access_block" "media" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "prod-wrestleutopia-media-bucket"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "us-east-2"
      + restrict_public_buckets = true
    }

Plan: 27 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p wrestleutopia-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fwrestleutopia-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p wrestleutopia-prod
  ```
Plan: 27 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```